'''a = input("введите сколько вам лет")
b = input("скажите свое имя")
print(a.upper(),b.lower()) 



a = "Hello"
b = True
c = a + str{b}
print(c) 


m = ("GitHub")
x = input("введите символ: ")
b = x .join(m)
print(b)
'''

с = input("введите своё имя: ")
a = input("введите свой возраст: ")
b = input("введите свой любимый фильм: ")
print(f"привет {с}, отличный фильм {b}"

e = len('''Google создаст спецыальную команду 
для багов в особо важных приложеня''')
print(e)



w = ("хакеры слили сеть данные пакистанской энергитической компании k-Elektric")
print(w.upper())

