# нулевая проблема
a = input("введите сколько вам лет")
b = input("скажите свое имя")
print(a.upper(),b.lower()) 


# первая проблема
b = str(True)
print(b) 

# вторая проблема
m = ("GitHub")
x = input("введите символ: ")
b = x .join(m)
print(b)

# третья проблема
t = 'Ботнет IPStorm , в который ранее входили лишь Windows-машины, увеличился до 13 500 зараженных систем'
v = t.replace("е", "3")
print(v)


# четвёртая проблема
с = input("введите своё имя: ")
a = input("введите свой возраст: ")
b = input("введите свой любимый фильм: ")
print(f"привет {с}, отличный фильм {b}")

# пятая проблема
e = len('''Google создаст спецыальную команду 
для багов в особо важных приложеня''')
print(e)

# шестая проблема
a = 'Самые важные собЫтия в миРе инфосека за сентябрь'
b = "|".join(a)
print(b)

# седьмая проблема
w = ("хакеры слили сеть данные пакистанской энергитической компании k-Elektric")
print(w.upper())

